{
  "name": "Game name.",
  "description": "Game description.",
  "win_ids": [18, 19],
  "loss_ids": [16, 17],
  "beginStep": 0,
  
  "steps": [
    {
      "id": 0,
      "text": "Вы просыпаетесь в своем доме, и на столе лежит записка. Что вы сделаете?",
      "options": [
        {
          "text": "Прочитать записку",
          "nextStep": 1
        },
        {
          "text": "Игнорировать и выйти на улицу",
          "nextStep": 2
        }
      ]
    },
    {
      "id": 1,
      "text": "Записка гласит: 'Иди в Зачарованный Лес, там тебя ждут приключения.' Вы решаете отправиться в лес.",
      "nextStep": 3
    },
    {
      "id": 2,
      "text": "Вы выходите на улицу и видите, что небо затянуто тучами. Вы решаете вернуться домой.",
      "nextStep": 4
    },
    {
      "id": 3,
      "text": "Вы входите в Зачарованный Лес. Вдруг вы видите два пути: один ведет к светящемуся озеру, другой - к темной пещере. Куда вы пойдете?",
      "options": [
        {
          "text": "К светящемуся озеру",
          "nextStep": 5
        },
        {
          "text": "К темной пещере",
          "nextStep": 6
        }
      ]
    },
    {
      "id": 4,
      "text": "Вы остаетесь дома и решаете заняться своим хобби. Игра заканчивается.",
      "nextStep": null
    },
    {
      "id": 5,
      "text": "Вы подходите к озеру и видите загадочную фигуру. Она предлагает вам выбрать: 'Секреты озера или силу воды?'",
      "options": [
        {
          "text": "Секреты озера",
          "nextStep": 7
        },
        {
          "text": "Силу воды",
          "nextStep": 8
        }
      ]
    },
    {
      "id": 6,
      "text": "Вы входите в пещеру и находите старый сундук. Он заперт, но рядом лежит ключ. Что вы сделаете?",
      "options": [
        {
          "text": "Открыть сундук",
          "nextStep": 9
        },
        {
          "text": "Игнорировать сундук и выйти",
          "nextStep": 10
        }
      ]
    },
    {
      "id": 7,
      "text": "Вы узнаете о древнем заклинании, которое может защитить вас от опасностей. Вы решаете использовать его.",
      "nextStep": 11
    },
    {
      "id": 8,
      "text": "Вы получаете силу управлять водой, что позволяет вам создавать водные барьеры. Вы чувствуете себя могущественно.",
      "nextStep": 12
    },
    {
      "id": 9,
      "text": "Сундук открывается, и вы находите сокровища. Вы становитесь богатым, но это привлекает внимание злого колдуна.",
      "nextStep": 13
    },
    {
      "id": 10,
      "text": "Вы выходите из пещеры и решаете продолжить исследование леса. Вы находите волшебный цветок.",
      "nextStep": 14
    },
    {
      "id": 11,
      "text": "С заклинанием вы чувствуете себя в безопасности. Вы решаете вернуться домой с новыми знаниями.",
      "nextStep": 15
    },
    {
      "id": 12,
      "text": "С силой воды вы помогаете жителям деревни, и они награждают вас. Вы становитесь героем.",
      "nextStep": 16
    },
    {
      "id": 13,
      "text": "Колдун находит вас и требует вернуть сокровища. Вы должны выбрать: сразиться или отдать сокровища.",
      "options": [
        {
          "text": "Сразиться",
          "nextStep": 17
        },
        {
          "text": "Отдать сокровища",
          "nextStep": 18
        }
      ]
    },
    {
      "id": 14,
      "text": "Волшебный цветок дарует вам необычные способности. Вы решаете использовать их, чтобы помочь другим.",
      "nextStep": 19
    },
    {
      "id": 15,
      "text": "Вы возвращаетесь домой, полные новых знаний и приключений. Игра заканчивается.",
      "nextStep": null
    },
    {
      "id": 16,
      "text": "Вы становитесь известным героем и продолжаете свои приключения в других землях. Игра заканчивается.",
      "nextStep": null
    },
    {
      "id": 17,
      "text": "Вы сражаетесь с колдуном и побеждаете его. Вы становитесь легендой в лесу.",
      "nextStep": null
    },
    {
      "id": 18,
      "text": "Вы отдаете сокровища колдуну, и он оставляет вас в покое. Вы возвращаетесь домой.",
      "nextStep": null
    },
    {
      "id": 19,
      "text": "Вы используете свои способности, чтобы стать защитником леса. Игра заканчивается.",
      "nextStep": null
    }
  ]
}